# GetStairs Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
StairsRun..::..GetStairs Method
StairsRun Class See Also
---
Returns the stairs to which the stairs run belongs.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public Stairs GetStairs()
```

Visual Basic
---
```text
Public Function GetStairs As Stairs
```

Visual C++
---
```text
public:
Stairs^ GetStairs()
```

# ### Return Value
The stairs to which the stairs run belongs.
# See Also
StairsRun Class
Autodesk.Revit.DB.Architecture Namespace